IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/TPTC01_TPTC01.xml
<module name="TPTC01_TPTC01" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="TPTC01_PID" acronym="TPTC01_PID" offset="0x0" width="32" description="">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="PID Scheme: Used to distinguish between old ID scheme and current. Spare bit to encode future schemes EDMA uses 'new scheme' indicated with value of 0x1." range="31 - 30" rwaccess="RO"/> 
		<bitfield id="FUNC" width="12" begin="27" end="16" resetval="0x0" description="Function indicates a software compatible module family." range="27 - 16" rwaccess="RO"/> 
		<bitfield id="RTL" width="5" begin="15" end="11" resetval="0x1" description="RTL Version" range="15 - 11" rwaccess="RO"/> 
		<bitfield id="MAJOR" width="3" begin="10" end="8" resetval="0x3" description="Major Revision" range="10 - 8" rwaccess="RO"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom revision field: Not used on this version of EDMA." range="7 - 6" rwaccess="RO"/> 
		<bitfield id="MINOR" width="6" begin="5" end="0" resetval="0x1" description="Minor Revision" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="TPTC01_TCCFG" acronym="TPTC01_TCCFG" offset="0x4" width="16" description="">
		<bitfield id="DREGDEPTH" width="2" begin="9" end="8" resetval="0x2" description="Dst Register FIFO Depth Parameterization" range="9 - 8" rwaccess="RO"/> 
		<bitfield id="BUSWIDTH" width="2" begin="5" end="4" resetval="0x2" description="Bus Width Parameterization" range="5 - 4" rwaccess="RO"/> 
		<bitfield id="FIFOSIZE" width="3" begin="2" end="0" resetval="0x4" description="Fifo Size Parameterization" range="2 - 0" rwaccess="RO"/>
	</register>
	<register id="TPTC01_TCSTAT" acronym="TPTC01_TCSTAT" offset="0x100" width="16" description="">
		<bitfield id="DFSTRTPTR" width="2" begin="13" end="12" resetval="0x0" description="Dst FIFO Start PointerRepresents the offset to the head entry of Dst Register FIFO in units of entries. Legal values = 0x0 to 0x3" range="13 - 12" rwaccess="RO"/> 
		<bitfield id="ACTV" width="1" begin="8" end="8" resetval="0x1" description="Channel ActiveChannel Active is a logical-OR of each of the BUSY/ACTV signals. The ACTV bit must remain high through the life of a TR.ACTV = 0 : Channel is idle.ACTV = 1 : Channel is busy." range="8" rwaccess="RO"/> 
		<bitfield id="DSTACTV" width="3" begin="6" end="4" resetval="0x0" description="Destination Active StateSpecifies the number of TRs that are resident in the Dst Register FIFO at a given instant.Legal values are constrained by the DSTREGDEPTH parameter." range="6 - 4" rwaccess="RO"/> 
		<bitfield id="WSACTV" width="1" begin="2" end="2" resetval="0x0" description="Write Status ActiveWSACTV = 0 : Write status is not pending. Write status has been received for all previously issued write commands.WSACTV = 1 : Write Status is pending. Write status has not been received for all previously issued write commands." range="2" rwaccess="RO"/> 
		<bitfield id="SRCACTV" width="1" begin="1" end="1" resetval="0x0" description="Source Active StateSRCACTV = 0 : Source Active set is idle. Any TR written to Prog Set will immediately transition to Source Active set as long as the Dst FIFO Set is not full [DSTFULL == 1].SRCACTV = 1 : Source Active set is busy either performing read transfers or waiting to perform read transfers for current Transfer Request." range="1" rwaccess="RO"/> 
		<bitfield id="PROGBUSY" width="1" begin="0" end="0" resetval="0x0" description="Program Register Set BusyPROGBUSY = 0 : Prog set idle and is available for programming.PROGBUSY = 1 : Prog set busy. User should poll for PROGBUSY equal to '0' prior to re-programming the Program Register set." range="0" rwaccess="RO"/>
	</register>
	<register id="TPTC01_INTSTAT" acronym="TPTC01_INTSTAT" offset="0x104" width="8" description="">
		<bitfield id="TRDONE" width="1" begin="1" end="1" resetval="0x0" description="TR Done Event Status:TRDONE = 0 : Condition not detected.TRDONE = 1 : Set when TC has completed a Transfer Request. TRDONE should be set when the write status is returned for the final write of a TR. Cleared when user writes '1' to INTCLR.TRDONE register bit." range="1" rwaccess="RO"/> 
		<bitfield id="PROGEMPTY" width="1" begin="0" end="0" resetval="0x0" description="Program Set Empty Event Status:PROGEMPTY = 0 : Condition not detected.PROGEMPTY = 1 : Set when Program Register set transitions to empty state. Cleared when user writes '1' to INTCLR.PROGEMPTY register bit." range="0" rwaccess="RO"/>
	</register>
	<register id="TPTC01_INTEN" acronym="TPTC01_INTEN" offset="0x108" width="8" description="">
		<bitfield id="TRDONE" width="1" begin="1" end="1" resetval="0x0" description="TR Done Event Enable:INTEN.TRDONE = 0 : TRDONE Event is disabled.INTEN.TRDONE = 1 : TRDONE Event is enabled and contributes to interrupt generation" range="1" rwaccess="RW"/> 
		<bitfield id="PROGEMPTY" width="1" begin="0" end="0" resetval="0x0" description="Program Set Empty Event Enable:INTEN.PROGEMPTY = 0 : PROGEMPTY Event is disabled.INTEN.PROGEMPTY = 1 : PROGEMPTY Event is enabled and contributes to interrupt generation" range="0" rwaccess="RW"/>
	</register>
	<register id="TPTC01_INTCLR" acronym="TPTC01_INTCLR" offset="0x10C" width="8" description="">
		<bitfield id="TRDONE" width="1" begin="1" end="1" resetval="0x0" description="TR Done Event Clear:INTCLR.TRDONE = 0 : Writes of '0' have no effect.INTCLR.TRDONE = 1 : Write of '1' clears INTSTAT.TRDONE bit" range="1" rwaccess="WO"/> 
		<bitfield id="PROGEMPTY" width="1" begin="0" end="0" resetval="0x0" description="Program Set Empty Event Clear:INTCLR.PROGEMPTY = 0 : Writes of '0' have no effect.INTCLR.PROGEMPTY = 1 : Write of '1' clears INTSTAT.PROGEMPTY bit" range="0" rwaccess="WO"/>
	</register>
	<register id="TPTC01_INTCMD" acronym="TPTC01_INTCMD" offset="0x110" width="8" description="">
		<bitfield id="SET" width="1" begin="1" end="1" resetval="0x0" description="Set TPTC interrupt:Write of '1' to SET causes TPTC interrupt to be pulsed unconditionally.Writes of '0' have no affect." range="1" rwaccess="WO"/> 
		<bitfield id="EVAL" width="1" begin="0" end="0" resetval="0x0" description="Evaluate state of TPTC interruptWrite of '1' to EVAL causes TPTC interrupt to be pulsed if any of the INTSTAT bits are set to '1'.Writes of '0' have no affect." range="0" rwaccess="WO"/>
	</register>
