IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/TPTC01_TPTC01.xml
	<register id="TPTC01_ERRSTAT" acronym="TPTC01_ERRSTAT" offset="0x120" width="8" description="">
		<bitfield id="MMRAERR" width="1" begin="3" end="3" resetval="0x0" description="MMR Address Error:MMRAERR = 0 : Condition not detected.MMRAERR = 1 : User attempted to read or write to invalid address configuration memory map. [Is only be set for non-emulation accesses]. No additional error information is recorded." range="3" rwaccess="RO"/> 
		<bitfield id="TRERR" width="1" begin="2" end="2" resetval="0x0" description="TR Error:TR detected that violates FIFO Mode transfer [SAM or DAM is '1'] alignment rules or has ACNT or BCNT == 0. No additional error information is recorded." range="2" rwaccess="RO"/> 
		<bitfield id="BUSERR" width="1" begin="0" end="0" resetval="0x0" description="Bus Error Event:BUSERR = 0: Condition not detected.BUSERR = 1: TC has detected an error code on the write response bus or read response bus. Error information is stored in Error Details Register [ERRDET]." range="0" rwaccess="RO"/>
	</register>
	<register id="TPTC01_ERREN" acronym="TPTC01_ERREN" offset="0x124" width="8" description="">
		<bitfield id="MMRAERR" width="1" begin="3" end="3" resetval="0x0" description="Interrupt enable for ERRSTAT.MMRAERR:ERREN.MMRAERR = 0 : BUSERR is disabled.ERREN.MMRAERR = 1 : MMRAERR is enabled and contributes to the TPTC error interrupt generation." range="3" rwaccess="RW"/> 
		<bitfield id="TRERR" width="1" begin="2" end="2" resetval="0x0" description="Interrupt enable for ERRSTAT.TRERR:ERREN.TRERR = 0 : BUSERR is disabled.ERREN.TRERR = 1 : TRERR is enabled and contributes to the TPTC error interrupt generation." range="2" rwaccess="RW"/> 
		<bitfield id="BUSERR" width="1" begin="0" end="0" resetval="0x0" description="Interrupt enable for ERRSTAT.BUSERR:ERREN.BUSERR = 0 : BUSERR is disabled.ERREN.BUSERR = 1 : BUSERR is enabled and contributes to the TPTC error interrupt generation." range="0" rwaccess="RW"/>
	</register>
	<register id="TPTC01_ERRCLR" acronym="TPTC01_ERRCLR" offset="0x128" width="8" description="">
		<bitfield id="MMRAERR" width="1" begin="3" end="3" resetval="0x0" description="Interrupt clear for ERRSTAT.MMRAERR:ERRCLR.MMRAERR = 0 : Writes of '0' have no effect.ERRCLR.MMRAERR = 1 : Write of '1' clears ERRSTAT.MMRAERR bit. Write of '1' to ERRCLR.MMRAERR does not clear the ERRDET register." range="3" rwaccess="WO"/> 
		<bitfield id="TRERR" width="1" begin="2" end="2" resetval="0x0" description="Interrupt clear for ERRSTAT.TRERR:ERRCLR.TRERR = 0 : Writes of '0' have no effect.ERRCLR.TRERR = 1 : Write of '1' clears ERRSTAT.TRERR bit. Write of '1' to ERRCLR.TRERR does not clear the ERRDET register." range="2" rwaccess="WO"/> 
		<bitfield id="BUSERR" width="1" begin="0" end="0" resetval="0x0" description="Interrupt clear for ERRSTAT.BUSERR:ERRCLR.BUSERR = 0 : Writes of '0' have no effect.ERRCLR.BUSERR = 1 : Write of '1' clears ERRSTAT.BUSERR bit. Write of '1' to  ERRCLR.BUSERR clears the ERRDET register." range="0" rwaccess="WO"/>
	</register>
	<register id="TPTC01_ERRDET" acronym="TPTC01_ERRDET" offset="0x12C" width="24" description="">
		<bitfield id="TCCHEN" width="1" begin="17" end="17" resetval="0x0" description="Contains the OPT.TCCHEN value programmed by the user for the Read or Write transaction that resulted in an error." range="17" rwaccess="RO"/> 
		<bitfield id="TCINTEN" width="1" begin="16" end="16" resetval="0x0" description="Contains the OPT.TCINTEN value programmed by the user for the Read or Write transaction that resulted in an error." range="16" rwaccess="RO"/> 
		<bitfield id="TCC" width="6" begin="13" end="8" resetval="0x0" description="Transfer Complete Code: Contains the OPT.TCC value programmed by the user for the Read or Write transaction that resulted in an error." range="13 - 8" rwaccess="RO"/> 
		<bitfield id="STAT" width="4" begin="3" end="0" resetval="0x0" description="Transaction Status:Stores the non-zero status/error code that was detected on the read status or write status bus.MS-bit effectively serves as the read vs. write error code.If read status and write status are returned on the same cycle then the TC chooses non-zero version. If both are non-zero then write status is treated as higher priority.Encoding of errors matches the CBA spec." range="3 - 0" rwaccess="RO"/>
	</register>
	<register id="TPTC01_ERRCMD" acronym="TPTC01_ERRCMD" offset="0x130" width="8" description="">
		<bitfield id="SET" width="1" begin="1" end="1" resetval="0x0" description="Set TPTC error interrupt:Write of '1' to SET causes TPTC error interrupt to be pulsed unconditionally.Writes of '0' have no affect." range="1" rwaccess="WO"/> 
		<bitfield id="EVAL" width="1" begin="0" end="0" resetval="0x0" description="Evaluate state of TPTC error interruptWrite of '1' to EVAL causes TPTC error interrupt to be pulsed if any of the ERRSTAT bits are set to '1'.Writes of '0' have no affect." range="0" rwaccess="WO"/>
	</register>
	<register id="TPTC01_RDRATE" acronym="TPTC01_RDRATE" offset="0x140" width="8" description="">
		<bitfield id="RDRATE" width="3" begin="2" end="0" resetval="0x0" description="Read Rate Control: Controls the number of cycles between read commands. This is a global setting that applies to all TRs for this TC." range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TPTC01_POPT" acronym="TPTC01_POPT" offset="0x200" width="32" description="">
		<bitfield id="DBG_ID" width="2" begin="29" end="28" resetval="0x0" description="Debug IDValue driven on the read (tptc_r_dbg_channel_id) and write (tptc_w_dbg_channel_id) command bus.Used at system level for trace/profiling of user selected transfers in systems that include this feature." range="29 - 28" rwaccess="RW"/> 
		<bitfield id="TCCHEN" width="1" begin="22" end="22" resetval="0x0" description="Transfer complete chaining enable:0: Transfer complete chaining is disabled.1: Transfer complete chaining is enabled." range="22" rwaccess="RW"/> 
		<bitfield id="TCINTEN" width="1" begin="20" end="20" resetval="0x0" description="Transfer complete interrupt enable:0: Transfer complete interrupt is disabled.1: Transfer complete interrupt is enabled." range="20" rwaccess="RW"/> 
		<bitfield id="TCC" width="6" begin="17" end="12" resetval="0x0" description="Transfer Complete Code: The 6-bit code is used to set the relevant bit in CER or IPR of the TPCC module." range="17 - 12" rwaccess="RW"/> 
		<bitfield id="FWID" width="3" begin="10" end="8" resetval="0x0" description="FIFO width control: Applies if either SAM or DAM is set to FIFO mode." range="10 - 8" rwaccess="RW"/> 
		<bitfield id="PRI" width="3" begin="6" end="4" resetval="0x0" description="Transfer Priority:0: Priority 0 - Highest priority1: Priority 1 ...7: Priority 7 - Lowest priority" range="6 - 4" rwaccess="RW"/> 
		<bitfield id="DAM" width="1" begin="1" end="1" resetval="0x0" description="Destination Address Mode within an array:0: INCR Dst addressing within an array increments.1: FIFO Dst addressing within an array wraps around upon reaching FIFO width." range="1" rwaccess="RW"/> 
		<bitfield id="SAM" width="1" begin="0" end="0" resetval="0x0" description="Source Address Mode within an array:0: INCR Src addressing within an array increments.1: FIFO Src addressing within an array wraps around upon reaching FIFO width." range="0" rwaccess="RW"/>
	</register>
	<register id="TPTC01_PSRC" acronym="TPTC01_PSRC" offset="0x204" width="32" description="">
		<bitfield id="SADDR" width="32" begin="31" end="0" resetval="0x0" description="Source address for Program Register Set" range="31 - 0" rwaccess="RW"/>
	</register>
