IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/TPTC01_TPTC01.xml
	<register id="TPTC01_DFACNT1" acronym="TPTC01_DFACNT1" offset="0x348" width="24" description="">
		<bitfield id="ACNT" width="23" begin="22" end="0" resetval="0x0" description="A-Dimension count. Number of bytes to be transferred infirst dimension." range="22 - 0" rwaccess="RO"/>
	</register>
	<register id="TPTC01_DFDST1" acronym="TPTC01_DFDST1" offset="0x34C" width="32" description="">
		<bitfield id="DADDR" width="32" begin="31" end="0" resetval="0x0" description="Destination address for Dst FIFO Register Set:Initial value is copied from PDST.DADDR.TC updates value according to destination addressing mode [OPT.SAM] and/or dest index value [BIDX.DBIDX] after each write command is issued.When a TR is complete the final value should be the address of the last write command issued." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="TPTC01_DFBIDX1" acronym="TPTC01_DFBIDX1" offset="0x350" width="32" description="">
		<bitfield id="DBIDX" width="16" begin="31" end="16" resetval="0x0" description="Dest B-Idx for Dest FIFO Register Set.Value copied from PBIDX: B-Idx offset between Destination arrays: Represents the offset in bytes between the starting address of each destination array [recall that there are BCNT arrays of ACNT elements].DBIDX is always used regardless of whether DAM is Increment or FIFO mode." range="31 - 16" rwaccess="RO"/> 
		<bitfield id="SBIDX" width="16" begin="15" end="0" resetval="0x0" description="Src B-Idx for Dest FIFO Register Set.Value copied from PBIDX: B-Idx offset between Source arrays: Represents the offset in bytes between the starting address of each source array [recall that there are BCNT arrays of ACNT elements].SBIDX is always used regardless of whether SAM is Increment or FIFO mode." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="TPTC01_DFMPPRXY1" acronym="TPTC01_DFMPPRXY1" offset="0x354" width="16" description="">
		<bitfield id="SECURE" width="1" begin="9" end="9" resetval="0x0" description="Secure Level: Deprecated, always read as 0." range="9" rwaccess="RO"/> 
		<bitfield id="PRIV" width="1" begin="8" end="8" resetval="0x0" description="Privilege Level:PRIV = 0 : User level privilegePRIV = 1 : Supervisor level privilegePMPPRXY.PRIV is always updated with the value from the configuration bus privilege field on any/every write to Program Set BIDX Register [trigger register].The PRIV value for the SA Set and DF Set are copied from the value in the Program set along with the remainder of the parameter values.The privilege ID is issued on the VBusM read and write command bus such that the target endpoints can perform memory protection checks based on the PRIV of the external host that sets up the DMA transaction." range="8" rwaccess="RO"/> 
		<bitfield id="PRIVID" width="4" begin="3" end="0" resetval="0x0" description="Privilege ID:PMPPRXY.PRIVID is always updated with the value from configuration bus privilege ID field on any/every write to Program Set BIDX Register [trigger register].The PRIVID value for the SA Set and DF Set are copied from the value in the Program set along with the remainder of the parameter values.The privilege ID is issued on the VBusM read and write command bus such that the target endpoints can perform memory protection checks based on the privid of the external host that sets up the DMA transaction." range="3 - 0" rwaccess="RO"/>
	</register>
	<register id="TPTC01_DFBCNT1" acronym="TPTC01_DFBCNT1" offset="0x358" width="16" description="">
		<bitfield id="BCNT" width="16" begin="15" end="0" resetval="0x0" description="B-Count Remaining for Dst Register Set:Number of arrays to be transferred where each array is ACNT in length.Represents the amount of data remaining to be written.Initial value is copied from PCNT.TC decrements ACNT and BCNT as necessary after each write dataphase is issued. Final value should be 0 when TR is complete." range="15 - 0" rwaccess="RO"/>
	</register>
</module>